# Decision Tree Classifier

## Basic Imports

In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.read_csv(r'C:\Users\Tarun\Desktop\comp\projects\Decision-tree-recommendations\train-titanic.csv')

In [3]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

## Pre-processing

In [4]:
data=df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis=1)

In [5]:
data.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [6]:
from sklearn.preprocessing import LabelEncoder

In [7]:
le_Sex=LabelEncoder()
data['Sex_label']=le_Sex.fit_transform(data['Sex'])

In [8]:
data.head()

   Survived  Pclass     Sex   Age     Fare  Sex_label
0         0       3    male  22.0   7.2500          1
1         1       1  female  38.0  71.2833          0
2         1       3  female  26.0   7.9250          0
3         1       1  female  35.0  53.1000          0
4         0       3    male  35.0   8.0500          1

In [9]:
data=data.drop(['Sex'],axis=1)

In [10]:
data.head()

   Survived  Pclass   Age     Fare  Sex_label
0         0       3  22.0   7.2500          1
1         1       1  38.0  71.2833          0
2         1       3  26.0   7.9250          0
3         1       1  35.0  53.1000          0
4         0       3  35.0   8.0500          1

In [11]:
#checking null values
print("before null values : ",data.isnull().sum())
print("Total number of rows : ",data.shape[0])
data=data.fillna(value=data['Age'].mean())

before null values :  Survived       0
Pclass         0
Age          177
Fare           0
Sex_label      0
dtype: int64
Total number of rows :  891

In [12]:
print("after removing null values : ",data.isnull().sum())

after removing null values :  Survived     0
Pclass       0
Age          0
Fare         0
Sex_label    0
dtype: int64

In [13]:
from sklearn.model_selection import train_test_split

training_data, testing_data = train_test_split(data, test_size=0.2, random_state=25)

print(f"No. of training examples: {training_data.shape[0]}")
print(f"No. of testing examples: {testing_data.shape[0]}")

No. of training examples: 712
No. of testing examples: 179

In [14]:
training_data.head()

     Survived  Pclass        Age     Fare  Sex_label
410         0       3  29.699118   7.8958          1
638         0       3  41.000000  39.6875          0
395         0       3  22.000000   7.7958          1
221         0       2  27.000000  13.0000          1
800         0       2  34.000000  13.0000          1

In [15]:
testing_data.head()

     Survived  Pclass        Age     Fare  Sex_label
760         0       3  29.699118  14.5000          1
773         0       3  29.699118   7.2250          1
266         0       3  16.000000  39.6875          1
507         1       1  29.699118  26.5500          1
524         0       3  29.699118   7.2292          1

In [16]:
train_target=training_data['Survived']
train_target.head()

410    0
638    0
395    0
221    0
800    0
Name: Survived, dtype: int64

In [17]:
training_data=training_data.drop(['Survived'],axis=1)
training_data.head()

     Pclass        Age     Fare  Sex_label
410       3  29.699118   7.8958          1
638       3  41.000000  39.6875          0
395       3  22.000000   7.7958          1
221       2  27.000000  13.0000          1
800       2  34.000000  13.0000          1

In [18]:
testing_target=testing_data['Survived']
testing_target.head()
testing_data=testing_data.drop(['Survived'],axis=1)
testing_data.head()

     Pclass        Age     Fare  Sex_label
760       3  29.699118  14.5000          1
773       3  29.699118   7.2250          1
266       3  16.000000  39.6875          1
507       1  29.699118  26.5500          1
524       3  29.699118   7.2292          1

## Decision Tree

In [19]:
from sklearn import tree

In [20]:
model = tree.DecisionTreeClassifier()

In [21]:
model.fit(training_data,train_target)

DecisionTreeClassifier()

In [22]:
model.score(testing_data,testing_target)

0.770949720670391

In [23]:
model.predict([[3,21,7.75,0]])

array([0], dtype=int64)